# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
# tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
# brew 'awscli'
brew 'ffmpeg', args: ['with-faac', 'with-fdk-aac', 'with-fontconfig', 'with-freetype', 'with-frei0r', 'with-libass', 'with-libbluray', 'with-libbs2b', 'with-libcaca', 'with-libebur128', 'with-libsoxr', 'with-libssh', 'with-libvidstab', 'with-libvorbis', 'with-libvpx', 'with-opencore-amr', 'with-openh264', 'with-openjpeg', 'with-openssl', 'with-opus', 'with-rtmpdump', 'with-rubberband', 'with-schroedinger', 'with-sdl', 'with-snappy', 'with-speex', 'with-theora', 'with-tools', 'with-webp', 'with-x265', 'with-xz', 'with-zeromq', 'with-zimg']
brew 'git'
brew 'git-flow-avh'
# brew 'hub'
# brew 'tree'
# brew 'mackup'
brew 'node'
# brew 'trash'
brew 'wget'

# Development
# brew 'php70', args: ['with-debug', 'without-apache']
# brew 'mariadb'

# Apps
cask '1password'
cask 'a-better-finder-rename'
# cask 'aerial'
cask 'alfred'
cask 'appcleaner'
# cask 'atom'
# cask 'caffeine'
# cask 'cheatsheet'
cask 'colloquy'
cask 'cyberduck'
cask 'dash'
cask 'daisydisk'
# cask 'divvy'
cask 'dropbox'
# cask 'evernote'
cask 'firefox'
# cask 'fluid'
cask 'google-chrome'
cask 'google-drive'
cask 'imageoptim'
cask 'iterm2'
cask 'libreoffice'
cask 'macpar-deluxe'
cask 'mailmate'
cask 'plex-home-theater'
cask 'plex-media-player'
cask 'plex-media-server'
cask 'poedit'
cask 'postgres'
cask 'pycharm-eap'
# cask 'mysqlworkbench'
# cask 'phpstorm'
# cask 'rescuetime'
# cask 'sequel-pro'
cask 'skype'
# cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'sublime-text'
cask 'teamviewer'
# cask 'textual'
# cask 'tower'
# cask 'transmit'
# cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-input'


# a52dec
# autoconf
# automake
# bash
# bash-completion
# berkeley-db
# binutils
# ccache
# check
# cmake
# dcadec
# expat
# faac
# faad2
# fdk-aac
# ffmpeg
# flac
# fltk
# flvstreamer
# fontconfig
# freetds
# freetype
# frei0r
# gcc
# gd
# gdbm
# gettext
# git
# git-extras
# git-flow-avh
# gmp
# gnu-getopt
# gnutls
# gpg-agent
# graphviz
# httpie
# icon-naming-utils
# icu4c
# imagemagick
# intltool
# jpeg
# jpeg-turbo
# keybase
# lame
# libass
# libassuan
# libbluray
# libbs2b
# libcaca
# libcroco
# libdv
# libdvdcss
# libdvdread
# libevent
# libgsf
# libmagic
# libmatroska
# libmpc
# libmpeg2
# libogg
# libpng
# libquicktime
# librsvg
# libsamplerate
# libsass
# libsigc++
# libsndfile
# libsoxr
# libssh
# libssh2
# libsvg
# libsvg-cairo
# libtiff
# libtool
# libvidstab
# libvo-aacenc
# libvorbis
# libvpx
# libwmf
# libxml2
# libxslt
# libyaml
# little-cms
# little-cms2
# lzo
# mcrypt
# mercurial
# mhash
# mkvtoolnix
# mpfr
# mysql
# nettle
# node
# openh264
# openjpeg
# openldap-libs
# openssl
# openvpn
# opus
# ossp-uuid
# p7zip
# pango
# pbzip2
# pcre
# pcre2
# pdf2svg
# pgtune
# pidof
# pixman
# pkg-config
# pngcrush
# poppler
# popt
# pstree
# pth
# pwgen
# pyenv
# pyenv-ccache
# pyenv-pip-rehash
# pyenv-virtualenv
# pyenv-virtualenvwrapper
# python
# python24
# python3
# readline
# realpath
# rrdtool
# rtmpdump
# ruby
# schroedinger
# sdl
# shared-mime-info
# sip
# snappy
# speex
# spice-protocol
# sqlite
# sslscan
# texi2html
# theora
# transcode
# tree
# unixodbc
# unrar
# vte3
# webp
# wget
# wv
# x264
# x265
# xvid
# xz
# yasm
# youtube-dl
# zimg
# zlib
# zopfli
# zsh
