# Taps
tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/services"

# Install ZSH
brew "zsh"
brew "antigen"

# Install core utilities
brew 'bash'
brew 'coreutils'
brew "gettext", link: true
brew "findutils"
brew "git"
brew "git-flow-avh"
brew "graphviz"
brew "openssl"
brew "pango"
brew "parallel"
brew "pwgen"
brew "readline"
brew "telnet"
brew "tinc", args: ["devel"]
brew "wget"
brew "xz"

# DEV
brew "node"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipenv"

# WEBDEV
brew "selenium-server-standalone"
brew "geckodriver"

# Databases
brew "libpq"
brew "mysql", restart_service: true
brew "postgresql", restart_service: true
brew "redis", restart_service: true

# Multimedia
brew "x265"
brew 'ffmpeg', args: ['with-faac', 'with-fdk-aac', 'with-fontconfig', 'with-freetype', 'with-frei0r', 'with-libass', 'with-libbluray', 'with-libbs2b', 'with-libcaca', 'with-libebur128', 'with-libsoxr', 'with-libssh', 'with-libvidstab', 'with-libvorbis', 'with-libvpx', 'with-opencore-amr', 'with-openh264', 'with-openjpeg', 'with-openssl', 'with-opus', 'with-rtmpdump', 'with-rubberband', 'with-schroedinger', 'with-sdl', 'with-snappy', 'with-speex', 'with-theora', 'with-tools', 'with-webp', 'with-x265', 'with-xz', 'with-zeromq', 'with-zimg']
brew "youtube-dl"

# MISC
brew "mailhog"
brew "mas"


# Apps
cask "1password"
cask "a-better-finder-rename"
cask "adium"
cask "alfred"
cask "caskroom/drivers/hp-easy-start"
cask "colloquy"
cask "cyberduck"
cask "daisydisk"
cask "dash"
cask "divvy"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "imageoptim"
cask "inkscape"
cask "iterm3"
cask "java"
cask "jetbrains-toolbox"
cask "krita"
cask "libreoffice"
cask "macpar-deluxe"
cask "mailmate"
cask "meld"
cask "mpv"
cask "poedit"
cask "postgres"
cask "riot"
cask "screenflow"
cask "sketchup"
cask "skype"
cask "sourcetree"
cask "teamviewer"
cask "tunnelblick"
cask "tuntap"
cask "virtualbox-extension-pack"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"

# Quicklook
cask "betterzipql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "webpquicklook"

# Fonts
cask "caskroom/fonts/font-input"
cask "caskroom/fonts/font-source-code-pro-for-powerline"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-source-sans-pro"
cask "caskroom/fonts/font-source-serif-pro"

# Mac App Store
mas "Boxy SVG", id: 611658502
mas "Faxbot", id: 640079107
mas "Keynote", id: 409183694
mas "Navicat for MySQL Lite", id: 412581753
mas "Navicat for PostgreSQL Lite", id: 412406630
mas "Navicat for SQLite Lite", id: 412542909
# mas "Numbers", id: 409203825
mas "NZBVortex 3", id: 914250185
# mas "OmniGraffle", id: 1142578753
mas "OneDrive", id: 823766827
# mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Telephone", id: 406825478
mas "Timelime", id: 589698946
mas "Twitter", id: 409789998
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
